#### `terraform plan` Success

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.kubernetes_cluster.digitalocean_kubernetes_cluster.default will be created
+ resource "digitalocean_kubernetes_cluster" "default" {
      + cluster_subnet = (known after apply)
      + created_at     = (known after apply)
      + endpoint       = (known after apply)
      + id             = (known after apply)
      + ipv4_address   = (known after apply)
      + kube_config    = (known after apply)
      + name           = "jdh"
      + region         = "sfo2"
      + service_subnet = (known after apply)
      + status         = (known after apply)
      + updated_at     = (known after apply)
      + version        = "1.15.3-do.1"

      + node_pool {
          + id         = (known after apply)
          + name       = "default"
          + node_count = 3
          + nodes      = (known after apply)
          + size       = "s-1vcpu-2gb"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
Releasing state lock. This may take a few moments...
```

</details>

*Workflow: `terraform`, Action: `hashicorpterraform-github-actions4`*